
GetPassphraseDescription = "Χρειάζεται κωδικός για να ξεκλειδώσετε το κρυφό κλειδί για τον χρήστη: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Χρειάζεται κωδικός για να ξεκλειδώσετε το κρυφό κλειδί για τον χρήστη: \"%@\", ID %@, (ID κυρίου κλειδιού %@)";
PassphraseLabel = "Κωδικός:";




/* For Key-Status */
"Invalid" = "Άκυρο";
"Revoked" = "Ανακληθέν";
"Expired" = "Ληγμένο";
"Disabled" = "Απενεργοποιημένο";
"Unknown" = "Άγνωστη";
"Never" = "Never";
"Marginal" = "Οριακή";
"Full" = "Πλήρης";
"Ultimate" = "Απόλυτη";


/* For Undo and Redo */
Undo_NewKey = "Νέο Κλειδί";
Undo_Delete = "Διαγραφή";
Undo_CleanKey = "Εκκαθάριση";
Undo_MinimizeKey = "Ελαχιστοποίηση";
Undo_RevokeKey = "Ανάκληση Κλειδιού";
Undo_ChangeExpirationDate = "Αλλαγή Ημερομηνίας Λήξης";
Undo_ChangePassphrase = "Αλλαγή Κωδικού";
Undo_AlgorithmPreferences = "Αλλαγή Προτιμήσεων Αλγορίθμων";
Undo_Import = "Εισαγωγή";
Undo_AddSignature = "Προσθήκη Υπογραφής";
Undo_RemoveSignature = "Αφαίρεση Υπογραφής";
Undo_RevokeSignature = "Ανάκληση Υπογραφής";
Undo_AddSubkey = "Προσθήκη Υποκλειδιού";
Undo_RemoveSubkey = "Αφαίρεση Υποκλειδιού";
Undo_RevokeSubkey = "Ανάκληση Υποκλειδιού";
Undo_AddUserID = "Προσθήκη Ταυτότητας Χρήστη";
Undo_RemoveUserID = "Αφαίρεση Ταυτότητας Χρήστη";
Undo_RevokeUserID = "Ανάκληση Ταυτότητας Χρήστη";
Undo_PrimaryUserID = "Κύρια Ταυτότητα Χρήστη";
Undo_AddPhoto = "Προσθήκη Φωτογραφίας";
Undo_RefreshFromServer = "Ανανέωση από τον εξυπηρετητή";
Undo_ReceiveFromServer = "Λήψη από τον εξυπηρετητή";



/* Algorithm names */
CIPHER_ALGO_NONE = "Κανένα";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Κανένα";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "edDSA";
"Algorithm_%i" = "Αλγόριθμος_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Υπογεγραμμένο";
"Signature expired" = "Η υπογραφή έχει λήξει";
"Key expired" = "Το κλειδί έχει λήξει";
"Bad signature" = "Η υπογραφή και τα δεδομένα δεν ταιριάζουν. Αυτό σημαίνει πως τα δεδομένα έχουν μεταβληθεί από άλλους.";
"Signature revoked" = "Η υπογραφή έχει ανακληθεί";
"Signature error" = "Σφάλμα υπογραφής";
"Unverifiable signature" = "Δεν ήταν δυνατή η επαλήθευση της υπογραφής.";
"Signed by stranger" = "Δεν ήταν δυνατή η επαλήθευση της υπογραφής, γιατί απουσιάζει το αντίστοιχο δημόσιο κλειδί.";


/* Key Descriptions */
KeyDescriptionAndMore = "and %lu more";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Warning: Your key is about to expire";
KeyExpiryWarning_Msg = "Your key will expire on %1$@:\n\n%2$@\n\nExpired keys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this key.\n\nIf you choose to extend your key, it will be valid for two more years.\n\nDo you want to extend your key?";
KeyExpiryWarning_Yes = "Extend Key";
KeyExpiryWarning_No = "Cancel";
KeyExpiryWarning_Suppress = "Do Not Ask Again";

SubkeyExpiryWarning_Title = "Warning: Your subkey is about to expire";
SubkeyExpiryWarning_Msg = "Your subkey will expire on %1$@:\n\n%2$@\n\nExpired subkeys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this subkey.\n\nIf you choose to extend your subkey, it will be valid for two more years.\n\nDo you want to extend your subkey?";
SubkeyExpiryWarning_Yes = "Extend Subkey";
SubkeyExpiryWarning_No = "Cancel";
SubkeyExpiryWarning_Suppress = "Do Not Ask Again";

WrongPasswordTryAgain_Title = "You entered the wrong password";
WrongPasswordTryAgain_Msg = "Do you want to try it again?";
WrongPasswordTryAgain_Yes = "Try Again";
WrongPasswordTryAgain_No = "Cancel";

KeyExpiryFailed_Title = "Failed to extend your key!";
KeyExpiryFailed_Msg = "The key\n%1$@\ncould not be extened.\n\nError: %2$@";

KeyExtendedWantToUpload_Title = "Your key was extended successfully";
KeyExtendedWantToUpload_Msg = "In order for others to be able to see the new expiration date, it is necessary for them to import your updated key. Therefore it is recommended to upload your updated public key to the key servers.\n\nWarning: Key servers are public, so the name and email you use in your key will be publicly visible. Keys can not be deleted from the key servers. They can be revoked but not removed.\n\nIf you rather prefer not to use key servers, please consider attaching your public key to your signed and encrypted emails.\n\nDo you want to upload your public key?";
KeyExtendedWantToUpload_Yes = "Upload Public Key";
KeyExtendedWantToUpload_No = "No, Thanks!";

UploadFailed_Title = "Failed to upload the key!";
UploadFailed_Msg = "The key could not be uploaded to the keyserver.\n\nError: %@";


UpdaterNotWorking_Title = "Η Εφαρμογή Ενημέρωσης του GPG Suite δε λειτουργεί όπως αναμένεται!";
UpdaterNotWorking_Msg = "Παρακαλώ κατεβάστε και επανεγκαταστήστε το GPG Suite από το https://gpgtools.org";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "Cancel";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


